--------------------------------------------------------------------------------
      name:  <unnamed>
       log:  \\studfiles.campus.uvt.nl\files\home\home04\u669074\tisem-airbnb\pr
> eclean\input/clean_raw.log
  log type:  text
 opened on:   3 Dec 2019, 19:52:00

. 
. import delimited using "input/calendar.csv", delimit(",") varn(1) clear
(4 vars, 1308890 obs)

. gen temp=date(date,"YMD")

. drop date

. rename temp date

. format date %td

. replace price=subinstr(price, "$","",1)
(643,037 real changes made)

. gen temp=real(price)
(668,421 missing values generated)

. drop price

. rename temp price

. collapse (last) price available,by(listing_id date)

. foreach i of varlist available {
  2. gen temp = (`i'=="t")
  3. drop `i'
  4. rename temp `i'
  5. }

. keep listing_id date price available

. save temp/calendar, replace
file temp/calendar.dta saved

. 
. 
. import excel using "input/listings.xlsx", firstrow clear

. drop A 

. rename id listing_id

. *listing_url-xl_picture_url host_url host_name host_location host_about ///
> *       host_thumbnail_url host_neighbourhood street-state market-country cale
> ndar_updated 
. foreach i of varlist price-cleaning_fee extra_people {
  2.         replace `i'=subinstr(`i', "$","",1)
  3.         gen temp=real(`i')
  4.         drop `i'
  5.         rename temp `i'
  6. }
(3,585 real changes made)
(12 missing values generated)
(892 real changes made)
(3,009 missing values generated)
(888 real changes made)
(3,541 missing values generated)
(1,342 real changes made)
(2,317 missing values generated)
(2,478 real changes made)
(1,107 missing values generated)
(3,585 real changes made)

. gen temp=date(host_since,"YMD")

. drop host_since

. rename temp host_since

. format host_since %td

. 
. foreach i of varlist host_response_rate host_acceptance_rate {
  2.  replace `i' = subinstr(`i',"%","",1)
  3.  gen temp = real(`i')
  4.  drop `i'
  5.  rename temp `i'
  6. }
(3,114 real changes made)
(471 missing values generated)
(3,114 real changes made)
(471 missing values generated)

. 
. gen age = (date(last_scraped,"YMD")-host_since)/365.25

. 
. foreach i of varlist host_is_superhost host_identity_verified {
  2. gen temp = (`i'=="t")
  3. drop `i'
  4. rename temp `i'
  5. }

. 
. save temp/listings, replace
file temp/listings.dta saved

. 
. import excel using "input/reviews.xlsx", firstrow clear

. drop A id

. gen temp=date(date,"YMD")

. drop date

. rename temp date

. format date %td

. save temp/reviews, replace
file temp/reviews.dta saved

. 
. /*use temp/calendar, clear
> *merge 1:m listing_id date using temp/reviews
> *drop _m
> merge m:1 listing_id using temp/listings, update
> drop _m
> save /output/dataset/main_airbnb, replace
> 
> cap erase temp/calerdar
> cap erase temp/listings
> cap erase temp/reviews*/
. 
. 
. 
. 
end of do-file

. pwd
\\studfiles.campus.uvt.nl\files\home\home04\u669074\tisem-airbnb\preclean

. cd ..
\\studfiles.campus.uvt.nl\files\home\home04\u669074\tisem-airbnb

. cd analysis
\\studfiles.campus.uvt.nl\files\home\home04\u669074\tisem-airbnb\analysis

. do "\\studfiles.campus.uvt.nl\files\home\home04\u669074\tisem-airbnb\preclean\
> code\audit.do"

. /* # loads ../output/dataset.do
> # produces some check graphics
> # like number of listings per date
> # summary statics on price
> # ...
> 
> # overall goal: data quality
> 
> 
> # --> produce plots in ../audit
> # produce log txt files with important statistics in ../audit/whatever.txt */
. 
. cap ssc install distinct

. cap ssc install estout

. clear all

. log close
      name:  <unnamed>
       log:  \\studfiles.campus.uvt.nl\files\home\home04\u669074\tisem-airbnb\pr
> eclean\input/clean_raw.log
  log type:  text
 closed on:   3 Dec 2019, 20:16:53
--------------------------------------------------------------------------------
